guntars-lemps/ch554_gamepad/usb_host.c

/********************************** (C) COPYRIGHT *******************************
* File Name          : USBHOST.C
* Author             : WCH
* Version            : V1.1
* Date               : 2018/02/28
* Description        : CH554 USB Host interface functions
*******************************************************************************/

#include <stdio.h>
#include <string.h>
#include "ch554.h"
#include "debug.h"
#include "usb_host.h"

extern __xdata __at (0x0000) uint8_t RxBuffer[MAX_PACKET_SIZE];
extern __xdata __at (0x0040) uint8_t TxBuffer[MAX_PACKET_SIZE];

#include "ch554_usb.h"

__bit HubLowSpeed;

// Define a user temporary buffer, which is used to process descriptors during enumeration.
// It can also be used as a normal temporary buffer after enumeration.
__xdata uint8_t  Com_Buffer[COM_BUF_SIZE];


/*******************************************************************************
* Function Name  : DisableRootHubPort( )
* Description    : Close HUB port
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void DisableRootHubPort()
{
#ifdef    FOR_ROOT_UDISK_ONLY
    CH554DiskStatus = DISK_DISCONNECT;
#endif
#ifndef    DISK_BASE_BUF_LEN
    ThisUsbDev.DeviceStatus = ROOT_DEV_DISCONNECT;
    ThisUsbDev.DeviceAddress = 0x00;
#endif
}


/*******************************************************************************
* Function Name: AnalyzeRootHub(void)
* Description: Analyze the ROOT-HUB status and handle the device plug-in and unplug events of the ROOT-HUB port.
               If the device is unplugged, the DisableRootHubPort() function is called in the function to close the port,
               insert the event, and set the status bit of the corresponding port.
* Input: None
* Output: None
* Return: Return ERR_SUCCESS if there is no situation,
*         return ERR_USB_CONNECT if a new connection is detected,
*         return ERR_USB_DISCON if a disconnection is detected
*******************************************************************************/
uint8_t AnalyzeRootHub(void)
{
    if (USB_MIS_ST & bUMS_DEV_ATTACH) {                                        // Device exists
#ifdef DISK_BASE_BUF_LEN
        if ((CH554DiskStatus == DISK_DISCONNECT) || ((UHOST_CTRL & bUH_PORT_EN) == 0)) {
#else
        if ((ThisUsbDev.DeviceStatus == ROOT_DEV_DISCONNECT) || ((UHOST_CTRL & bUH_PORT_EN) == 0)) { // Device detected plugged in
#endif
            // It is detected that a device is plugged in, but it has not been allowed yet, indicating that it has just been plugged in.
            DisableRootHubPort();                                                   // close port
#ifdef DISK_BASE_BUF_LEN
            CH554DiskStatus = DISK_CONNECT;
#else
            ThisUsbDev.DeviceStatus = ROOT_DEV_CONNECTED;                            // Set connection flag
#endif
#if DE_PRINTF
            printf("USB dev in\n");
#endif
            return ERR_USB_CONNECT;
        }
    }
#ifdef DISK_BASE_BUF_LEN
    else if (CH554DiskStatus >= DISK_CONNECT) {
#else
    else if (ThisUsbDev.DeviceStatus >= ROOT_DEV_CONNECTED) {                 // Device unplug detected
#endif
        DisableRootHubPort();                                                     // close port
#if DE_PRINTF
        printf("USB dev out\n");
#endif
        return ERR_USB_DISCON;

    }
    return ERR_SUCCESS;
}


/*******************************************************************************
* Function Name  : SetHostUsbAddr
* Description    : Set the USB device address currently operated by the USB host
* Input          : uint8_t addr
* Output         : None
* Return         : None
*******************************************************************************/
void SetHostUsbAddr(uint8_t addr)
{
    USB_DEV_AD = USB_DEV_AD & bUDA_GP_BIT | addr & 0x7F;
}

#ifndef    FOR_ROOT_UDISK_ONLY


/*******************************************************************************
* Function Name  : SetUsbSpeed
* Description    : Set current USB speed
* Input          : uint8_t FullSpeed
* Output         : None
* Return         : None
*******************************************************************************/
void SetUsbSpeed(uint8_t FullSpeed)
{
    if (FullSpeed) {                                                           // full speed
        USB_CTRL &= ~ bUC_LOW_SPEED;                                           // full speed
        UH_SETUP &= ~ bUH_PRE_PID_EN;                                          // Disable PRE PID
    } else {
        USB_CTRL |= bUC_LOW_SPEED;                                             // low speed
    }
}
#endif


/*******************************************************************************
* Function Name  : ResetRootHubPort( )
* Description    : After a device is detected, the bus is reset to prepare for device enumeration and is set to default to full speed.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void ResetRootHubPort()
{
    UsbDevEndp0Size = DEFAULT_ENDP0_SIZE;                                      // Maximum packet size for USB device endpoint 0
#ifndef DISK_BASE_BUF_LEN
    memset(&ThisUsbDev, 0, sizeof(ThisUsbDev));                                // Clear the structure
#endif
    SetHostUsbAddr(0x00);
    UHOST_CTRL &= ~bUH_PORT_EN;                                // close port
    SetUsbSpeed(1);                                          // Default is full speed
    UHOST_CTRL = UHOST_CTRL & ~ bUH_LOW_SPEED | bUH_BUS_RESET; // Default is full speed, start reset
    mDelaymS(20);                                              // Reset time 10mS to 20mS
    UHOST_CTRL = UHOST_CTRL & ~ bUH_BUS_RESET;                 // End reset
    mDelayuS(250);
    UIF_DETECT = 0;                                            // Clear interrupt flag
}


/*******************************************************************************
* Function Name  : EnableRootHubPort( )
* Description    : Enable the ROOT-HUB port and set the corresponding bUH_PORT_EN to 1 to enable the port.
                   Disconnection of the device may result in return failure.
* Input          : None
* Output         : None
* Return         : Return ERR_SUCCESS if a new connection is detected, and return ERR_USB_DISCON if there is no connection.
*******************************************************************************/
uint8_t   EnableRootHubPort( )
{
#ifdef DISK_BASE_BUF_LEN
    if (CH554DiskStatus < DISK_CONNECT) {
        CH554DiskStatus = DISK_CONNECT;
    }
#else
    if (ThisUsbDev.DeviceStatus < ROOT_DEV_CONNECTED) {
        ThisUsbDev.DeviceStatus = ROOT_DEV_CONNECTED;
    }
#endif
    if (USB_MIS_ST & bUMS_DEV_ATTACH) {                                      // Have equipment
#ifndef DISK_BASE_BUF_LEN
        if ((UHOST_CTRL & bUH_PORT_EN) == 0x00) {                            // Not yet enabled
            ThisUsbDev.DeviceSpeed = USB_MIS_ST & bUMS_DM_LEVEL ? 0 : 1;
            if (ThisUsbDev.DeviceSpeed == 0) {
                UHOST_CTRL |= bUH_LOW_SPEED;      // low speed
            }
        }
#endif
        USB_CTRL |= bUC_DMA_EN;     // Start the USB host and DMA, and automatically pause before the interrupt flag is cleared.
        UH_SETUP = bUH_SOF_EN;
        UHOST_CTRL |= bUH_PORT_EN;  // Enable HUB port
        return (ERR_SUCCESS);
    }
    return (ERR_USB_DISCON);
}
#ifndef DISK_BASE_BUF_LEN


