guntars-lemps/ch554_gamepad/usb_host.c
/*******************************************************************************
* Function Name  : SelectHubPort( uint8_t HubPortIndex )
* Description    : Select the HUB port to be operated
* Input          : uint8_t HubPortIndex Select the specified port of the external HUB to operate the specified ROOT-HUB port.
* Output         : None
* Return         : None
*******************************************************************************/
void SelectHubPort(uint8_t HubPortIndex)
{
    if (HubPortIndex) {                                                         // 选择操作指定的ROOT-HUB端口的外部HUB的指定端口
        SetHostUsbAddr(DevOnHubPort[HubPortIndex-1].DeviceAddress);          // 设置USB主机当前操作的USB设备地址
        SetUsbSpeed(DevOnHubPort[HubPortIndex-1].DeviceSpeed);               // 设置当前USB速度
        if (DevOnHubPort[HubPortIndex-1].DeviceSpeed == 0) {                   // 通过外部HUB与低速USB设备通讯需要前置ID
            UH_SETUP |= bUH_PRE_PID_EN;                                        // 启用PRE PID
            HubLowSpeed = 1;
            mDelayuS(100);
        }
    } else {
        HubLowSpeed = 0;
        SetHostUsbAddr(ThisUsbDev.DeviceAddress);                            // 设置USB主机当前操作的USB设备地址
        SetUsbSpeed(ThisUsbDev.DeviceSpeed);                                 // 设置USB设备的速度
    }
}
#endif


/*******************************************************************************
* Function Name  : WaitUSB_Interrupt
* Description    : 等待USB中断
* Input          : None
* Output         : None
* Return         : 返回ERR_SUCCESS 数据接收或者发送成功
                   ERR_USB_UNKNOWN 数据接收或者发送失败
*******************************************************************************/
uint8_t WaitUSB_Interrupt(void)
{
    uint16_t  i;
    for (i = WAIT_USB_TOUT_200US; i != 0 && UIF_TRANSFER == 0; i --){;}
    return (UIF_TRANSFER ? ERR_SUCCESS : ERR_USB_UNKNOWN);
}


/*******************************************************************************
* Function Name  : USBHostTransact
* Description    : CH554传输事务,输入目的端点地址/PID令牌,同步标志,以20uS为单位的NAK重试总时间(0则不重试,0xFFFF无限重试),返回0成功,超时/出错重试
                   本子程序着重于易理解,而在实际应用中,为了提供运行速度,应该对本子程序代码进行优化
* Input          : uint8_t endp_pid 令牌和地址  endp_pid: 高4位是token_pid令牌, 低4位是端点地址
                   uint8_t tog      同步标志
                   uint16_t timeout 超时时间
* Output         : None
* Return         : ERR_USB_UNKNOWN 超时，可能硬件异常
                   ERR_USB_DISCON  设备断开
                   ERR_USB_CONNECT 设备连接
                   ERR_SUCCESS     传输完成
*******************************************************************************/
uint8_t USBHostTransact(uint8_t endp_pid, uint8_t tog, uint16_t timeout)
{
#define    TransRetry    UEP0_T_LEN                                                   // 节约内存
    uint8_t   s, r;
    uint16_t  i;
    UH_RX_CTRL = UH_TX_CTRL = tog;
    TransRetry = 0;

    do {
        UH_EP_PID = endp_pid;                                                      // 指定令牌PID和目的端点号
        UIF_TRANSFER = 0;                                                          // 允许传输
        for (i = WAIT_USB_TOUT_200US; i != 0 && UIF_TRANSFER == 0; i --);
        UH_EP_PID = 0x00;                                                          // 停止USB传输
        if (UIF_TRANSFER == 0) {
            return (ERR_USB_UNKNOWN);
        }
        if (UIF_DETECT) {                                                        // USB设备插拔事件
            UIF_DETECT = 0;                                                          // 清中断标志
            s = AnalyzeRootHub();                                                   // 分析ROOT-HUB状态
            if (s == ERR_USB_CONNECT) {
                FoundNewDev = 1;
            }
#ifdef DISK_BASE_BUF_LEN
            if (CH554DiskStatus == DISK_DISCONNECT) {
                return (ERR_USB_DISCON);      // USB设备断开事件
            }
            if (CH554DiskStatus == DISK_CONNECT) {
                return (ERR_USB_CONNECT);        // USB设备连接事件
            }
#else
            if (ThisUsbDev.DeviceStatus == ROOT_DEV_DISCONNECT) {
                return (ERR_USB_DISCON); // USB设备断开事件
            }
            if (ThisUsbDev.DeviceStatus == ROOT_DEV_CONNECTED) {
                return (ERR_USB_CONNECT); // USB设备连接事件
            }
#endif
            mDelayuS (200);  // 等待传输完成
        }
        if (UIF_TRANSFER) {  // 传输完成
            if (U_TOG_OK) {
                return (ERR_SUCCESS);
            }
            r = USB_INT_ST & MASK_UIS_H_RES;  // USB设备应答状态
            if (r == USB_PID_STALL) {
                return (r | ERR_USB_TRANSFER);
            }
            if (r == USB_PID_NAK) {
                if (timeout == 0) {
                    return (r | ERR_USB_TRANSFER);
                }
                if (timeout < 0xFFFF) {
                    timeout --;
                }
                TransRetry--;
            } else {
                switch (endp_pid >> 4) {
                    case USB_PID_SETUP:
                    case USB_PID_OUT:
                        if (r) {
                            return (r | ERR_USB_TRANSFER);  // 不是超时/出错,意外应答
                        }
                        break;  // 超时重试
                    case USB_PID_IN:
                        if ((r == USB_PID_DATA0) && (r == USB_PID_DATA1)) {  // 不同步则需丢弃后重试
                            // 不同步重试
                        }  else if (r) {
                            return (r | ERR_USB_TRANSFER);  // 不是超时/出错,意外应答
                        }
                        break;  // 超时重试
                    default:
                        return (ERR_USB_UNKNOWN);  // 不可能的情况
                        break;
                }
            }
        } else { // 其它中断,不应该发生的情况
            USB_INT_FG = 0xFF;  /* 清中断标志 */
        }
        mDelayuS(15);
    } while (++TransRetry < 3);
    return (ERR_USB_TRANSFER);  // 应答超时
}


/*******************************************************************************
* Function Name  : HostCtrlTransfer
* Description    : 执行控制传输,8字节请求码在pSetupReq中,DataBuf为可选的收发缓冲区
* Input          : P__xdata uint8_t DataBuf 如果需要接收和发送数据,那么DataBuf需指向有效缓冲区用于存放后续数据
                   Puint8_t RetLen  实际成功收发的总长度保存在RetLen指向的字节变量中
* Output         : None
* Return         : ERR_USB_BUF_OVER IN状态阶段出错
                   ERR_SUCCESS     数据交换成功
                   其他错误状态
*******************************************************************************/
uint8_t HostCtrlTransfer(__xdata uint8_t *DataBuf, uint8_t *RetLen)
{
    uint16_t  RemLen  = 0;
    uint8_t   s, RxLen, RxCnt, TxCnt;
    __xdata uint8_t  *pBuf;
    uint8_t  *pLen;
    pBuf = DataBuf;
    pLen = RetLen;
    mDelayuS(200);
    if (pLen) {
        *pLen = 0;                                                              // 实际成功收发的总长度
    }
    UH_TX_LEN = sizeof(USB_SETUP_REQ);
    s = USBHostTransact((uint8_t)(USB_PID_SETUP << 4 | 0x00), 0x00, 10000);          // SETUP阶段,200mS超时
    if (s != ERR_SUCCESS) {
        return (s);
    }
    UH_RX_CTRL = UH_TX_CTRL = bUH_R_TOG | bUH_R_AUTO_TOG | bUH_T_TOG | bUH_T_AUTO_TOG; // 默认DATA1
    UH_TX_LEN = 0x01;                                                           // 默认无数据故状态阶段为IN
    RemLen = (pSetupReq -> wLengthH << 8) | (pSetupReq -> wLengthL);
    if (RemLen && pBuf) {                                                       // 需要收发数据
        if (pSetupReq -> bRequestType & USB_REQ_TYP_IN) {                       // 收
            while (RemLen) {
                mDelayuS(200);
                s = USBHostTransact((uint8_t)(USB_PID_IN << 4 | 0x00), UH_RX_CTRL, (200000 / 20)); // IN数据
                if (s != ERR_SUCCESS) {
                    return (s);
                }
                RxLen = USB_RX_LEN < RemLen ? USB_RX_LEN : RemLen;
                RemLen -= RxLen;
                if (pLen) {
                    *pLen += RxLen;                                              // 实际成功收发的总长度
                }
                for (RxCnt = 0; RxCnt != RxLen; RxCnt ++) {
                    *pBuf = RxBuffer[ RxCnt ];
                    pBuf ++;
                }
                if ((USB_RX_LEN == 0) || (USB_RX_LEN & (UsbDevEndp0Size - 1))) {
                    break;                                                       // 短包
                }
            }
            UH_TX_LEN = 0x00;                                                    // 状态阶段为OUT
        } else {                                                                   // 发
            while (RemLen) {
                mDelayuS( 200 );
                UH_TX_LEN = (RemLen >= UsbDevEndp0Size) ? UsbDevEndp0Size : RemLen;
#ifndef DISK_BASE_BUF_LEN
                if (pBuf[1] == 0x09) {                                             // HID类命令处理
                    Set_Port = Set_Port^1;
                    *pBuf = Set_Port;
#if DE_PRINTF
                    printf ("SET_PORT  %02X  %02X ", (uint16_t)(*pBuf), (uint16_t)(Set_Port));
#endif
                }
#endif
                for (TxCnt = 0; TxCnt != UH_TX_LEN; TxCnt++) {
                    TxBuffer[TxCnt] = *pBuf;
                    pBuf++;
                }
                s = USBHostTransact(USB_PID_OUT << 4 | 0x00, UH_TX_CTRL, (200000 / 20)); // OUT数据
                if (s != ERR_SUCCESS) {
                    return (s);
                }
                RemLen -= UH_TX_LEN;
                if (pLen) {
                    *pLen += UH_TX_LEN;                                           // 实际成功收发的总长度
                }
            }
        }
    }
    mDelayuS(200);
    s = USBHostTransact((UH_TX_LEN ? (USB_PID_IN << 4 | 0x00): (USB_PID_OUT << 4 | 0x00)), (bUH_R_TOG | bUH_T_TOG), (200000 / 20)); // STATUS阶段
    if (s != ERR_SUCCESS) {
        return (s);
    }
    if (UH_TX_LEN == 0) {
        return (ERR_SUCCESS); // 状态OUT
    }
    if (USB_RX_LEN == 0) {
        return (ERR_SUCCESS); // 状态IN,检查IN状态返回数据长度
    }
    return (ERR_USB_BUF_OVER); // IN状态阶段错误
}


