guntars-lemps/ch554_gamepad/usb_host.c
/*******************************************************************************
* Function Name  : CopySetupReqPkg
* Description    : 复制控制传输的请求包
* Input          : P__code uint8_t pReqPkt 控制请求包地址
* Output         : None
* Return         : None
*******************************************************************************/
void CopySetupReqPkg(__code uint8_t *pReqPkt)                // 复制控制传输的请求包
{
    uint8_t   i;
    if (HubLowSpeed) {                                       // HUB下低速设备
        ((__xdata uint8_t *)pSetupReq)[0] = *pReqPkt;
        for (i = 1; i != sizeof(USB_SETUP_REQ) + 1; i ++) {
            ((__xdata uint8_t *)pSetupReq)[i] = *pReqPkt;
            pReqPkt++;
        }
    }
    if (HubLowSpeed == 0) {
        for (i = 0; i != sizeof(USB_SETUP_REQ); i++) {
            ((__xdata uint8_t *)pSetupReq)[i] = *pReqPkt;
            pReqPkt++;
        }
    }
}


/*******************************************************************************
* Function Name  : CtrlGetDeviceDescr
* Description    : 获取设备描述符,返回在TxBuffer中
* Input          : None
* Output         : None
* Return         : ERR_USB_BUF_OVER 描述符长度错误
                   ERR_SUCCESS      成功
                   其他
*******************************************************************************/
uint8_t CtrlGetDeviceDescr(void) {
    uint8_t  s;
    uint8_t  len;
    UsbDevEndp0Size = DEFAULT_ENDP0_SIZE;
    CopySetupReqPkg(SetupGetDevDescr);
    s = HostCtrlTransfer(Com_Buffer, (uint8_t *)&len); // 执行控制传输
    if (s != ERR_SUCCESS) {
        return (s);
    }
    UsbDevEndp0Size = ((PXUSB_DEV_DESCR)Com_Buffer) -> bMaxPacketSize0; // 端点0最大包长度,这是简化处理,正常应该先获取前8字节后立即更新UsbDevEndp0Size再继续
    if (len < ((PUSB_SETUP_REQ)SetupGetDevDescr) -> wLengthL) {
        return (ERR_USB_BUF_OVER); // 描述符长度错误
    }
    return (ERR_SUCCESS);
}


/*******************************************************************************
* Function Name  : CtrlGetConfigDescr
* Description    : 获取配置描述符,返回在TxBuffer中
* Input          : None
* Output         : None
* Return         : ERR_USB_BUF_OVER 描述符长度错误
                   ERR_SUCCESS      成功
                   其他
*******************************************************************************/
uint8_t CtrlGetConfigDescr(void)
{
    uint8_t s, len;
    CopySetupReqPkg(SetupGetCfgDescr);
    s = HostCtrlTransfer(Com_Buffer, (uint8_t *)&len); // 执行控制传输
    if (s != ERR_SUCCESS) {
        return (s);
    }

    len = ((PXUSB_CFG_DESCR)Com_Buffer) -> wTotalLengthL;
    CopySetupReqPkg(SetupGetCfgDescr);
    if (HubLowSpeed) { // HUB下低速设备
        pSetupReq -> wLengthH = len; // 完整配置描述符的总长度
    }
    if (HubLowSpeed == 0) {
        pSetupReq -> wLengthL = len; // 完整配置描述符的总长度
    }
    s = HostCtrlTransfer(Com_Buffer, (uint8_t *)&len); // 执行控制传输
    if (s != ERR_SUCCESS) {
        return (s);
    }
#ifdef DISK_BASE_BUF_LEN
    if (len > 64) {
        len = 64;
    }
    for (s = 0; s != len; s++) { // U盘操作时，需要拷贝到TxBuffer
        TxBuffer[s] = Com_Buffer[s];
    }
#endif
    return (ERR_SUCCESS);
}


/*******************************************************************************
* Function Name  : CtrlSetUsbAddress
* Description    : 设置USB设备地址
* Input          : uint8_t addr 设备地址
* Output         : None
* Return         : ERR_SUCCESS      成功
                   其他
*******************************************************************************/
uint8_t CtrlSetUsbAddress(uint8_t addr)
{
    uint8_t   s;
    CopySetupReqPkg(SetupSetUsbAddr);
    if (HubLowSpeed) {                                                               //HUB下低速设备
        pSetupReq -> wValueH = addr;                                                // USB设备地址
    }
    if (HubLowSpeed == 0) {
        pSetupReq -> wValueL = addr;                                                // USB设备地址
    }
    s = HostCtrlTransfer(NULL, NULL);                                         // 执行控制传输
    if (s != ERR_SUCCESS) {
        return (s);
    }
    SetHostUsbAddr (addr);                                                     // 设置USB主机当前操作的USB设备地址
    mDelaymS(10);                                                             // 等待USB设备完成操作
    return (ERR_SUCCESS);
}


/*******************************************************************************
* Function Name  : CtrlSetUsbConfig
* Description    : 设置USB设备配置
* Input          : uint8_t cfg       配置值
* Output         : None
* Return         : ERR_SUCCESS      成功
                   其他
*******************************************************************************/
uint8_t CtrlSetUsbConfig(uint8_t cfg)
{
    CopySetupReqPkg(SetupSetUsbConfig);
    if (HubLowSpeed) {                                                               //HUB下低速设备
        pSetupReq -> wValueH = cfg;                                                // USB设备配置
    }
    if (HubLowSpeed == 0) {
        pSetupReq -> wValueL = cfg;                                                // USB设备配置
    }
    return (HostCtrlTransfer(NULL, NULL));                                  // 执行控制传输
}


/*******************************************************************************
* Function Name  : CtrlClearEndpStall
* Description    : 清除端点STALL
* Input          : uint8_t endp       端点地址
* Output         : None
* Return         : ERR_SUCCESS      成功
                   其他
*******************************************************************************/
uint8_t CtrlClearEndpStall(uint8_t endp)
{
    CopySetupReqPkg(SetupClrEndpStall);                                      // 清除端点的错误
    if (HubLowSpeed) {                                                               //HUB下低速设备
        pSetupReq -> wIndexH = endp;                                               // 端点地址
    }
    if (HubLowSpeed == 0) {
        pSetupReq -> wIndexL = endp;                                               // 端点地址
    }
    return (HostCtrlTransfer(NULL, NULL));                                  // 执行控制传输
}

#ifndef DISK_BASE_BUF_LEN


/*******************************************************************************
* Function Name  : CtrlSetUsbIntercace
* Description    : 设置USB设备接口
* Input          : uint8_t cfg       配置值
* Output         : None
* Return         : ERR_SUCCESS      成功
                   其他
*******************************************************************************/
uint8_t CtrlSetUsbIntercace(uint8_t cfg)
{
    CopySetupReqPkg(SetupSetUsbInterface);
    if (HubLowSpeed) {                                                              //HUB下低速设备
        pSetupReq -> wValueH = cfg;                                                 // USB设备配置
    }
    if (HubLowSpeed == 0) {
        pSetupReq -> wValueL = cfg;                                                 // USB设备配置
    }
    return (HostCtrlTransfer(NULL, NULL));                             // 执行控制传输
}


