guntars-lemps/ch554_gamepad/usb_host.c
/*******************************************************************************
* Function Name  : CtrlGetHIDDeviceReport
* Description    : 获取HID设备报表描述符,返回在TxBuffer中
* Input          : None
* Output         : None
* Return         : ERR_SUCCESS 成功
                   其他        错误
*******************************************************************************/
uint8_t CtrlGetHIDDeviceReport(uint8_t infc)
{
    uint8_t s;
    uint8_t len;

    CopySetupReqPkg(SetupSetHIDIdle);
    if (HubLowSpeed) {                                                               // HUB下低速设备
        TxBuffer[5] = infc;
    } else {
        TxBuffer[4] = infc;
    }
    s = HostCtrlTransfer(Com_Buffer, (uint8_t *)&len);                                // 执行控制传输
    if (s != ERR_SUCCESS) {
        return (s);
    }

    CopySetupReqPkg(SetupGetHIDDevReport);
    if (HubLowSpeed) {                                                              // HUB下低速设备
        TxBuffer[5] = infc;
    } else {
        TxBuffer[4] = infc;
    }
    s = HostCtrlTransfer(Com_Buffer, (uint8_t *)&len);                                    // 执行控制传输
    if (s != ERR_SUCCESS) {
        return (s);
    }

    return (ERR_SUCCESS);
}


/*******************************************************************************
* Function Name  : CtrlGetHubDescr
* Description    : 获取HUB描述符,返回在TxBuffer中
* Input          : None
* Output         : None
* Return         : ERR_SUCCESS 成功
                   ERR_USB_BUF_OVER 长度错误
*******************************************************************************/
uint8_t CtrlGetHubDescr(void)
{
    uint8_t  s;
    uint8_t  len;
    CopySetupReqPkg(SetupGetHubDescr);
    s = HostCtrlTransfer(Com_Buffer, (uint8_t *)&len);                     // 执行控制传输
    if (s != ERR_SUCCESS) {
        return (s);
    }
    if (len < ((PUSB_SETUP_REQ)SetupGetHubDescr) -> wLengthL) {
        return (ERR_USB_BUF_OVER);                                            // 描述符长度错误
    }
    return (ERR_SUCCESS);
}


/*******************************************************************************
* Function Name  : HubGetPortStatus
* Description    : 查询HUB端口状态,返回在TxBuffer中
* Input          : uint8_t HubPortIndex
* Output         : None
* Return         : ERR_SUCCESS 成功
                   ERR_USB_BUF_OVER 长度错误
*******************************************************************************/
uint8_t HubGetPortStatus(uint8_t HubPortIndex)
{
    uint8_t   s;
    uint8_t  len;
    pSetupReq -> bRequestType = HUB_GET_PORT_STATUS;
    pSetupReq -> bRequest = HUB_GET_STATUS;
    pSetupReq -> wValueL = 0x00;
    pSetupReq -> wValueH = 0x00;
    pSetupReq -> wIndexL = HubPortIndex;
    pSetupReq -> wIndexH = 0x00;
    pSetupReq -> wLengthL = 0x04;
    pSetupReq -> wLengthH = 0x00;
    s = HostCtrlTransfer(Com_Buffer, (uint8_t *)&len);                         // 执行控制传输
    if (s != ERR_SUCCESS) {
        return (s);
    }
    if (len < 4) {
        return (ERR_USB_BUF_OVER);                                            // 描述符长度错误
    }
    return (ERR_SUCCESS);
}


/*******************************************************************************
* Function Name  : HubSetPortFeature
* Description    : 设置HUB端口特性
* Input          : uint8_t HubPortIndex    //HUB端口
                   uint8_t FeatureSelt     //HUB端口特性
* Output         : None
* Return         : ERR_SUCCESS 成功
                   其他        错误
*******************************************************************************/
uint8_t HubSetPortFeature(uint8_t HubPortIndex, uint8_t FeatureSelt)
{
    pSetupReq -> bRequestType = HUB_SET_PORT_FEATURE;
    pSetupReq -> bRequest = HUB_SET_FEATURE;
    pSetupReq -> wValueL = FeatureSelt;
    pSetupReq -> wValueH = 0x00;
    pSetupReq -> wIndexL = HubPortIndex;
    pSetupReq -> wIndexH = 0x00;
    pSetupReq -> wLengthL = 0x00;
    pSetupReq -> wLengthH = 0x00;
    return (HostCtrlTransfer(NULL, NULL));                                 // 执行控制传输
}


/*******************************************************************************
* Function Name  : HubClearPortFeature
* Description    : 清除HUB端口特性
* Input          : uint8_t HubPortIndex                                         //HUB端口
                   uint8_t FeatureSelt                                          //HUB端口特性
* Output         : None
* Return         : ERR_SUCCESS 成功
                   其他        错误
*******************************************************************************/
uint8_t HubClearPortFeature(uint8_t HubPortIndex, uint8_t FeatureSelt)
{
    pSetupReq -> bRequestType = HUB_CLEAR_PORT_FEATURE;
    pSetupReq -> bRequest = HUB_CLEAR_FEATURE;
    pSetupReq -> wValueL = FeatureSelt;
    pSetupReq -> wValueH = 0x00;
    pSetupReq -> wIndexL = HubPortIndex;
    pSetupReq -> wIndexH = 0x00;
    pSetupReq -> wLengthL = 0x00;
    pSetupReq -> wLengthH = 0x00;
    return (HostCtrlTransfer(NULL, NULL));                                // 执行控制传输
}


/*******************************************************************************
* Function Name  : CtrlGetXPrinterReport1
* Description    : 打印机类命令
* Input          : None
* Output         : None
* Return         : ERR_USB_BUF_OVER 描述符长度错误
                   ERR_SUCCESS      成功
                   其他
*******************************************************************************/
uint8_t CtrlGetXPrinterReport1(void)
{
    uint8_t  s;
    uint16_t len;
    CopySetupReqPkg(XPrinterReport);
    s = HostCtrlTransfer(Com_Buffer, (uint8_t *)&len);                         // 执行控制传输
    if (s != ERR_SUCCESS) {
        return (s);
    }
    return (ERR_SUCCESS);
}


/*******************************************************************************
* Function Name  : AnalyzeHidIntEndp
* Description    : 从描述符中分析出HID中断端点的地址,如果HubPortIndex是0保存到ROOTHUB，如果是非零值则保存到HUB下结构体
* Input          : P__xdata uint8_t buf ： 待分析数据缓冲区地址 HubPortIndex：0表示根HUB，非0表示外部HUB下的端口号
* Output         : None
* Return         : 端点数
*******************************************************************************/
uint8_t AnalyzeHidIntEndp(__xdata uint8_t *buf, uint8_t HubPortIndex)
{
    uint8_t i, s, l;
    s = 0;

    if (HubPortIndex) {
        memset(DevOnHubPort[HubPortIndex-1].GpVar, 0, sizeof(DevOnHubPort[HubPortIndex-1].GpVar)); // 清空数组
    } else {
        memset(ThisUsbDev.GpVar, 0, sizeof(ThisUsbDev.GpVar));                     //清空数组
    }

