guntars-lemps/ch554_gamepad/usb_host.c
/*******************************************************************************
* Function Name  : SearchTypeDevice
* Description    : 在ROOT-HUB以及外部HUB各端口上搜索指定类型的设备所在的端口号,输出端口号为0xFFFF则未搜索到
* Input          : uint8_t type 搜索的设备类型
* Output         : None
* Return         : 输出高8位为ROOT-HUB端口号,低8位为外部HUB的端口号,低8位为0则设备直接在ROOT-HUB端口上
                   当然也可以根据USB的厂商VID产品PID进行搜索(事先要记录各设备的VID和PID),以及指定搜索序号
*******************************************************************************/
uint16_t SearchTypeDevice(uint8_t type)
{
    uint8_t RootHubIndex;                                                          // CH554只有一个USB口,RootHubIndex = 0,只需看返回值的低八位即可
    uint8_t HubPortIndex;

    RootHubIndex = 0;
    if ((ThisUsbDev.DeviceType == USB_DEV_CLASS_HUB) && (ThisUsbDev.DeviceStatus >= ROOT_DEV_SUCCESS)) { // 外部集线器HUB且枚举成功
        for (HubPortIndex = 1; HubPortIndex <= ThisUsbDev.GpHUBPortNum; HubPortIndex ++) { // 搜索外部HUB的各个端口
            if ((DevOnHubPort[HubPortIndex - 1].DeviceType == type) && (DevOnHubPort[HubPortIndex - 1].DeviceStatus >= ROOT_DEV_SUCCESS)) {
                return (((uint16_t)RootHubIndex << 8 ) | HubPortIndex);           // 类型匹配且枚举成功
            }
        }
    }
    if ((ThisUsbDev.DeviceType == type) && (ThisUsbDev.DeviceStatus >= ROOT_DEV_SUCCESS)) {
        return ((uint16_t)RootHubIndex << 8);                                      // 类型匹配且枚举成功,在ROOT-HUB端口上
    }

    return (0xFFFF);
}


/*******************************************************************************
* Function Name  : SETorOFFNumLock
* Description    : NumLock的点灯判断
* Input          : Puint8_t buf 点灯键值
* Output         : None
* Return         : None
*******************************************************************************/
uint8_t SETorOFFNumLock(uint8_t *buf)
{
    uint8_t tmp[]= {0x21,0x09,0x00,0x02,0x00,0x00,0x01,0x00};
    uint8_t len,s;
    if ((buf[2] == 0x53) & (buf[0] | buf[1] | buf[3] | buf[4] | buf[5] | buf[6] | buf[7] == 0)) {
        if (HubLowSpeed) {                                                            // HUB下低速设备
            ((__xdata uint8_t *)pSetupReq)[0] = 0x21;
            for (s = 1; s != sizeof(tmp) + 1; s++) {
                ((__xdata uint8_t *)pSetupReq)[s] = tmp[s];
            }
        }
        if (HubLowSpeed == 0) {
            for (s = 0; s != sizeof( tmp ); s++) {
                ((__xdata uint8_t *)pSetupReq)[s] = tmp[s];
            }
        }
        s = HostCtrlTransfer(Com_Buffer, &len);                                     // 执行控制传输
        if (s != ERR_SUCCESS) {
            return (s);
        }
    }
    return (ERR_SUCCESS);
}
#endif


#ifdef DISK_BASE_BUF_LEN
uint8_t InitRootDevice(void)                                                       // 初始化USB设备
{
    uint8_t i, s, cfg, dv_cls, if_cls;
#if DE_PRINTF
    printf("Reset host port\n");
#endif
    ResetRootHubPort();                                                        // 检测到设备后,复位相应端口的USB总线
    for (i = 0, s = 0; i < 100; i++) {                                         // 等待USB设备复位后重新连接,100mS超时
        mDelaymS(1);
        if (EnableRootHubPort() == ERR_SUCCESS) {                                  // 使能端口
            i = 0;
            s ++;                                                                  // 计时等待USB设备连接后稳定
            if (s > 100) {
                break;                                                  // 已经稳定连接100mS
            }
        }
    }
    if (i) {                                                                      // 复位后设备没有连接
        DisableRootHubPort( );
#if DE_PRINTF
        printf("Disable host port because of disconnect\n");
#endif
        return (ERR_USB_DISCON);
    }
    SetUsbSpeed(1);                                                              // 设置当前USB速度
    s = CtrlGetDeviceDescr();                                                     // 获取设备描述符
    if (s == ERR_SUCCESS) {
#if DE_PRINTF
        printf("GetDevDescr: ");
        for (i = 0; i < ((PUSB_SETUP_REQ)SetupGetDevDescr) -> wLengthL; i++) {
            printf("x%02X ", (uint16_t)(Com_Buffer[i]));
        }
        printf("\n");                                                             // 显示出描述符
#endif
        dv_cls = ((PXUSB_DEV_DESCR)Com_Buffer) -> bDeviceClass;                 // 设备类代码
        s = CtrlSetUsbAddress(((PUSB_SETUP_REQ)SetupSetUsbAddr) -> wValueL);    // 设置USB设备地址
        if (s == ERR_SUCCESS) {
            s = CtrlGetConfigDescr();                                                // 获取配置描述符
            if (s == ERR_SUCCESS) {
                cfg = ((PXUSB_CFG_DESCR)Com_Buffer) -> bConfigurationValue;
#if DE_PRINTF
                printf("GetCfgDescr: ");
                for (i = 0; i < ((PXUSB_CFG_DESCR)Com_Buffer) -> wTotalLengthL; i++) {
                    printf("x%02X ", (uint16_t)(Com_Buffer[i]));
                }
                printf("\n");
#endif
/* 分析配置描述符,获取端点数据/各端点地址/各端点大小等,更新变量endp_addr和endp_size等 */
                if_cls = ((PXUSB_CFG_DESCR_LONG)Com_Buffer) -> itf_descr.bInterfaceClass; // 接口类代码
                if ((dv_cls == 0x00) && (if_cls == USB_DEV_CLASS_STORAGE)) {            // 是USB存储类设备,基本上确认是U盘
                    CH554DiskStatus = DISK_USB_ADDR;
                    return (ERR_SUCCESS);
                } else {
                    return (ERR_USB_UNSUPPORT);
                }
            }
        }
    }
#if DE_PRINTF
    printf("InitRootDev Err = %02X\n", (uint16_t)s);
#endif
    CH554DiskStatus = DISK_CONNECT;
    SetUsbSpeed(1);                                                              // 默认为全速
    return (s);
}
#endif


/*******************************************************************************
* Function Name  : InitUSB_Host
* Description    : 初始化USB主机
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void InitUSB_Host(void)
{
    uint8_t   i;
    IE_USB = 0;
    USB_CTRL = bUC_HOST_MODE;                                                    // 先设定模式
    UHOST_CTRL &= ~bUH_PD_DIS;                                                   //启用主机下拉
    USB_DEV_AD = 0x00;
    UH_EP_MOD = bUH_EP_TX_EN | bUH_EP_RX_EN ;
    UH_RX_DMA = (uint16_t)RxBuffer;
    UH_TX_DMA = (uint16_t)TxBuffer;
    UH_RX_CTRL = 0x00;
    UH_TX_CTRL = 0x00;
    USB_CTRL = bUC_HOST_MODE | bUC_INT_BUSY; // 启动USB主机及DMA,在中断标志未清除前自动暂停
    USB_INT_FG = 0xFF;                                                          // 清中断标志
    for (i = 0; i != 2; i++) {
        DisableRootHubPort();                                                   // 清空
    }
    USB_INT_EN = bUIE_TRANSFER | bUIE_DETECT;
}

